{"backend": "tensorflow", "config": {"output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "name": "input_1", "sparse": false}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_1"}, "class_name": "Conv2D", "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "axis": [3], "scale": true, "name": "batch_normalization_1", "momentum": 0.99, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_2"}, "class_name": "Conv2D", "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "axis": [3], "scale": true, "name": "batch_normalization_2", "momentum": 0.99, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "filters": 16, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_3"}, "class_name": "Conv2D", "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "axis": [3], "scale": true, "name": "batch_normalization_3", "momentum": 0.99, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "filters": 8, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_4"}, "class_name": "Conv2D", "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "axis": [3], "scale": true, "name": "batch_normalization_4", "momentum": 0.99, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "filters": 4, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_5"}, "class_name": "Conv2D", "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "axis": [3], "scale": true, "name": "batch_normalization_5", "momentum": 0.99, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_5"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "seed": null, "dtype": "float32", "rate": 0.4, "name": "dropout_1"}, "class_name": "Dropout", "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 512, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense", "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "seed": null, "dtype": "float32", "rate": 0.4, "name": "dropout_2"}, "class_name": "Dropout", "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 124, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_2"}, "class_name": "Dense", "name": "dense_2"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 29, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_3"}, "class_name": "Dense", "name": "dense_3"}]}, "class_name": "Model", "keras_version": "2.1.5-tf"}